cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/cask-fonts"
tap "universal-ctags/universal-ctags"
tap "joshuaclayton/formulae"

brew "ack"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
brew "docker"
brew "docker-machine"
brew "elixir"
brew "git"
brew "hub"
brew "yarn"
brew "zsh"
brew "neovim"
brew "rbenv"
brew "ruby-build"
brew "zsh"
brew "zsh-syntax-highlighting"
brew "direnv"
brew "redis", restart_service: true
brew "postgresql", restart_service: true
brew "the_silver_searcher"
brew "imagemagick"
brew "cmake"
brew "bat"
brew "tree"
brew "mongodb"
brew "unused"
brew "tmux"
brew "tmate"
brew "fzf"
brew "reattach-to-user-namespace"

cask "chromedriver"
cask "tableplus"
cask "sip"
cask "dropbox"
cask "graphql-playground"
cask "google-chrome"
cask "alfred"
cask "dash"
cask "spotify"
cask "slack"
cask "transmission"
cask "vlc"
cask "authy"
cask "bartender"
cask "divvy"
cask "gpg-suite"
cask "aerial"
cask "whatsapp"
cask "textual"
cask "the-unarchiver"
cask "iterm2"
cask "docker"
cask "ngrok"
cask "firefox"
cask "spectacle"
cask "hammerspoon"
cask "figma"
cask "tunnelblick"
cask "zoomus"
cask "font-source-code-pro"
cask "telegram"

mas "todoist", id: 585829637
mas "medis", id: 1063631769
mas "1password", id: 1333542190
mas "markoff", id: 1084713122
mas "daisydisk", id: 411643860
mas "gifox", id: 1082624744
