cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/cask-fonts"
tap "universal-ctags/universal-ctags"
tap "joshuaclayton/formulae"
tap "nexeck/homebrew-tmuxinator"
tap "elastic/tap"
tap "mongodb/brew"

brew "ack"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
brew "docker"
brew "docker-machine"
brew "elixir"
brew "git"
brew "hub"
brew "yarn"
brew "zsh"
brew "neovim"
brew "zsh"
brew "zsh-syntax-highlighting"
brew "direnv"
brew "redis", restart_service: true
brew "postgresql", restart_service: true
brew "the_silver_searcher"
brew "imagemagick"
brew "cmake"
brew "bat"
brew "tree"
brew "mongodb-community@3.6"
brew "unused"
brew "tmux"
brew "tmate"
brew "fzf"
brew "reattach-to-user-namespace"
brew "asdf"
brew "elastic/tap/elasticsearch-full"
brew "gh"

cask "chromedriver"
cask "graphiql"
cask "google-chrome"
cask "alfred"
cask "spotify"
cask "vlc"
cask "authy"
cask "gpg-suite"
cask "whatsapp"
cask "the-unarchiver"
cask "docker"
cask "ngrok"
cask "firefox"
cask "hammerspoon"
cask "figma"
cask "viscosity"
cask "font-source-code-pro"
cask "telegram"

mas "todoist", id: 585829637
mas "medis", id: 1063631769
mas "daisydisk", id: 411643860
mas "micro-snitch", id: 972028355
mas "bear", id: 1091189122
