cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"

brew "ack"
brew "ctags"
brew "docker"
brew "docker-machine"
brew "elixir"
brew "git"
brew "heroku"
brew "hub"
brew "yarn"
brew "zsh"
brew "neovim"
brew "rbenv"
brew "ruby-build"
brew "tmux"
brew "tmate"
brew "zsh"
brew "zsh-syntax-highlighting"
brew "direnv"
brew "redis", restart_service: true
brew "postgresql", restart_service: true

cask "tableplus"
cask "sip"
cask "dropbox"
cask "graphql-playground"
cask "google-chrome"
cask "1password"
cask "alfred"
cask "dash"
cask "spotify"
cask "slack"
cask "transmission"
cask "tunnelbear"
cask "vlc"
cask "authy"
cask "bartender"
cask "divvy"
cask "basecamp"
cask "harvest"
cask "gpg-suite"
cask "notion"

mas "todoist", id: 585829637
